constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       940;
    }
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       1030;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       1040;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          500;
        startFace       1060;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          500;
        startFace       1560;
    }
)

// ************************************************************************* //
