0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  	outlet{
		type  fixedValue;
		value  uniform 0;
	}

  	outlet_vac{
		type  fixedValue;
		value  uniform 0;
//		type  zeroGradient;
	}

	walls{
		type  zeroGradient;
	}

	inlet{
		type  zeroGradient;
	}
	
	porous_half0
    {
        type            porousBafflePressure;
        patchType       cyclic;
        D               1000;
        I               500;
        length          0.15;
        uniformJump     true;
        jump            uniform 0;
        value           uniform 0;
    }
    porous_half1
    {
        type            porousBafflePressure;
        patchType       cyclic;
        D               1000;
        I               500;
        length          0.15;
        uniformJump     true;
        jump            uniform 0;
        value           uniform 0;
    }
    
        back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
