system/fvSchemes


FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
	object      fvScheme;
}

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(rhoPhi,U)  Gauss  vanLeerV; //linearUpwind grad(U);
    div(phi,alpha)  Gauss vanLeer;
    div(phirb,alpha) Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;

        //div((muEff*dev(T(grad(U))))) Gauss linear;
       //div(rho*phi,U) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

/*fluxRequired
{
    default         no;
    p_rgh;
    pcorr;
    alpha.water;
}*/
