system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volVectorFieldValue U (0 0 0)
);

regions
(
    sphereToCell
    {
        //centre (100e-6 250e-6 .1e-6);
        centre (150e-6 150e-6 .1e-6);
        radius 80e-6; //was 100

        fieldValues
        (
            volScalarFieldValue alpha.water 1
            
        );
    }


    /*
        boxToCell
    {
        box (0e-6 100e-6 -500e-6) (100e-6 200e-6 500e-6);
        fieldValues
        (
            volScalarFieldValue alpha.water 0
        );
    }*/

 );


// ************************************************************************* //
